Back End API/kulinerku/app/Models/KeranjangModel.php

    public function getAllKeranjang()
    {
        return $this
        ->join('products', 'products.id = keranjang.product_id')
        ->select('keranjang.*, products.nama, products.harga, products.gambar')
        ->findAll();
---
SELECT `keranjang`.*, `products`.`nama`, `products`.`harga`, `products`.`gambar`
FROM `keranjang`
JOIN `products` ON `products`.`id` = `keranjang`.`product_id`