Back End API/kulinerku/app/Controllers/Keranjang.php

    public function delete($id = null)
    {
        $data = $this->keranjang->find($id);
---
SELECT *
FROM `keranjang`
WHERE `keranjang`.`id` = 'undefined'