Back End API/kulinerku/app/Controllers/Products.php

    public function update($id = null)
    {
        if ($this->request) {
            if ($this->request->getJSON()) {
                $json = $this->request->getJSON();

                $data = $this->update($json->id, [
                    'kode' => $json->kode,
                    'nama' => $json->nama,
                    'harga' => $json->harga,
                    'gambar' => $json->gambar,
                    'is_ready' => $json->is_ready,
                ]);
            } else {
                $product = $this->request->getRawInput();
                $data = $this->update($id, $product);
---
UPDATE `products` SET `id` = '13', `kode` = NULL, `nama` = NULL, `harga` = NULL, `is_ready` = NULL, `updated_at` = '2024-02-26 04:44:55'
WHERE `products`.`id` IN ('13')