Back End API/kulinerku/app/Controllers/Products.php

SELECT *
FROM `products`
ORDER BY `id` DESC
---
    public function index()
    {
        $data = $this->products->orderBy('id', 'desc')->findAll();

INSERT INTO `products` (`kode`, `nama`, `harga`, `gambar`, `is_ready`, `created_at`, `updated_at`) VALUES ('F-05', 'Martabak Manis', '20000.00', '', '1', '2024-02-22 01:50:05', '2024-02-22 01:50:05')
---
    public function create()
    {
        if ($this->request) {
            $gambar = $this->request->getFile('gambar');

            if ($gambar->isValid()) {
                $gambarName = $gambar->getRandomName();
                $gambar->move('upload', $gambarName);

                $data = $this->products->insert([
                    'kode' => $this->request->getVar('kode'),
                    'nama' => $this->request->getVar('nama'),
                    'harga' => $this->request->getVar('harga'),
                    'gambar' => $gambarName,
                    'is_ready' => $this->request->getVar('is_ready')
                ]);

SELECT *
FROM `products`
WHERE `products`.`id` = '23'
---
    public function update($id = null)
    {
        $product = $this->products->find($id);

UPDATE `products` SET `id` = '23', `kode` = NULL, `nama` = NULL, `harga` = NULL, `is_ready` = NULL, `updated_at` = '2024-02-29 08:08:44'
WHERE `products`.`id` IN ('23')
---
        }

        // Lakukan pembaruan produk
        $updated = $this->products->update($id, $data);